app/views/calenders/calender.html.erb

SELECT  "calenders".* FROM "calenders" WHERE "calenders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <h2>
    <% calender = Calender.find_by(id: @calender_id) %>