app/views/calenders/mypage.html.erb

SELECT  "calenders".* FROM "calenders" WHERE "calenders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <% @calenders_admitted.each do |calender_admitted| %>
    <% calender=Calender.find_by(id: calender_admitted.calender_id) %>