app/views/calenders/schedule.html.erb

SELECT "schedules"."date" FROM "schedules" WHERE "schedules"."user_id" = ?  [["user_id", 10]]
SELECT "schedules"."impossible" FROM "schedules" WHERE "schedules"."user_id" = ?  [["user_id", 10]]
---
<% dates = Schedule.where(user_id: session[:user_id]).pluck(:date) %>
<% impossibles = Schedule.where(user_id: session[:user_id]).pluck(:impossible) %>