app/controllers/calenders_controller.rb

  def create
    calender=Calender.new(
      name: params[:name],
      admin_id: session[:user_id],
      room_id: params[:room_id]
    )
    if calender.save
      redirect_to("/calenders/mypage")
      calender_admitted=CalenderAdmitted.new(
        user_id: session[:user_id],
        calender_id: calender.id
      )
      calender_admitted.save
---
INSERT INTO "calenders" ("name", "admin_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "WWN"], ["admin_id", 10], ["room_id", 1234], ["created_at", "2020-10-02 05:25:58.902654"], ["updated_at", "2020-10-02 05:25:58.902654"]]
INSERT INTO "calender_admitteds" ("user_id", "calender_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 10], ["calender_id", 3], ["created_at", "2020-10-02 07:48:19.545251"], ["updated_at", "2020-10-02 07:48:19.545251"]]

  def mypage
    @calenders_admitted=CalenderAdmitted.where(user_id: session[:user_id])
---
SELECT  "calender_admitteds".* FROM "calender_admitteds" WHERE "calender_admitteds"."user_id" = ? LIMIT ?  [["user_id", 10], ["LIMIT", 1]]

  def join
    if calender=Calender.find_by(
        name: params[:name],
        room_id: params[:room_id]
      )
      calender_admitted=CalenderAdmitted.new(
        user_id: session[:user_id],
        calender_id: calender.id
      )
      calender_admitted.save
---
SELECT  "calenders".* FROM "calenders" WHERE "calenders"."name" = ? AND "calenders"."room_id" = ? LIMIT ?  [["name", "WWN"], ["room_id", 1234], ["LIMIT", 1]]
INSERT INTO "calender_admitteds" ("user_id", "calender_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 11], ["calender_id", 1], ["created_at", "2020-10-03 03:14:18.343131"], ["updated_at", "2020-10-03 03:14:18.343131"]]

  def schedule
    params[:check].each do | di1,di2 |
      if di2 == "1"
        if schedule = Schedule.find_by(
            user_id: session[:user_id],
            calender_id: params[:calender_id],
            month: Date.current.month,
            date: di1,
          )
          schedule.update(impossible: "1")
        else
          schedule = Schedule.new(
            user_id: session[:user_id],
            calender_id: params[:calender_id],
            month: Date.current.month,
            date: di1,
            impossible: "1"
          )
          schedule.save
        end
      else
        if schedule = Schedule.find_by(
            user_id: session[:user_id],
            calender_id: params[:calender_id],
            month: Date.current.month,
            date: di1,
          )
          schedule.update(impossible: "0")
---
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."user_id" = ? AND "schedules"."calender_id" = ? AND "schedules"."month" = ? AND "schedules"."date" = ? LIMIT ?  [["user_id", 10], ["calender_id", 1], ["month", 10], ["date", 1], ["LIMIT", 1]]
UPDATE "schedules" SET "impossible" = ?, "updated_at" = ? WHERE "schedules"."id" = ?  [["impossible", 1], ["updated_at", "2020-10-13 08:38:40.881424"], ["id", 229]]
INSERT INTO "schedules" ("user_id", "calender_id", "month", "date", "impossible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 11], ["calender_id", 1], ["month", 10], ["date", 1], ["impossible", 1], ["created_at", "2020-10-13 08:37:19.935017"], ["updated_at", "2020-10-13 08:37:19.935017"]]
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."user_id" = ? AND "schedules"."calender_id" = ? AND "schedules"."month" = ? AND "schedules"."date" = ? LIMIT ?  [["user_id", 10], ["calender_id", 1], ["month", 10], ["date", 6], ["LIMIT", 1]]
UPDATE "schedules" SET "impossible" = ?, "updated_at" = ? WHERE "schedules"."id" = ?  [["impossible", 0], ["updated_at", "2020-10-13 08:38:40.515337"], ["id", 224]]

            date: di1,
            impossible: "0"
          )
          schedule.save
---
INSERT INTO "schedules" ("user_id", "calender_id", "month", "date", "impossible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 11], ["calender_id", 1], ["month", 10], ["date", 7], ["impossible", 0], ["created_at", "2020-10-13 08:37:20.026037"], ["updated_at", "2020-10-13 08:37:20.026037"]]