app/controllers/users_controller.rb

  def create
    @user=User.new(
      ign: params[:ign],
      password: params[:password],
      clan: params[:clan],
      roll: params[:roll]
    )
    if @user.save
---
INSERT INTO "users" ("ign", "password", "clan", "roll", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["ign", "WWNE_tai"], ["password", "0808"], ["clan", "WWN-E"], ["roll", "代表"], ["created_at", "2020-09-30 07:29:24.961855"], ["updated_at", "2020-09-30 07:29:24.961855"]]

  def login
    @user=User.find_by(ign: params[:ign],
                       password: params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."ign" = ? AND "users"."password" = ? LIMIT ?  [["ign", "a"], ["password", "a"], ["LIMIT", 1]]